expriment/fio/varyblocksize-SSD.log
pmem-r-random-256: (g=0): rw=randread, bs=(R) 256B-256B, (W) 256B-256B, (T) 256B-256B, ioengine=psync, iodepth=1
pmem-r-random-512: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=psync, iodepth=1
pmem-r-random-1024: (g=0): rw=randread, bs=(R) 1024B-1024B, (W) 1024B-1024B, (T) 1024B-1024B, ioengine=psync, iodepth=1
pmem-r-random-2048: (g=0): rw=randread, bs=(R) 2048B-2048B, (W) 2048B-2048B, (T) 2048B-2048B, ioengine=psync, iodepth=1
pmem-r-random-4096: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
pmem-w-random-256: (g=0): rw=randwrite, bs=(R) 256B-256B, (W) 256B-256B, (T) 256B-256B, ioengine=psync, iodepth=1
pmem-w-random-512: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=psync, iodepth=1
pmem-w-random-1024: (g=0): rw=randwrite, bs=(R) 1024B-1024B, (W) 1024B-1024B, (T) 1024B-1024B, ioengine=psync, iodepth=1
pmem-w-random-2048: (g=0): rw=randwrite, bs=(R) 2048B-2048B, (W) 2048B-2048B, (T) 2048B-2048B, ioengine=psync, iodepth=1
pmem-w-random-4096: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.27-30-gea510
Starting 10 processes

fio: terminating on signal 2

pmem-r-random-256: (groupid=0, jobs=1): err= 0: pid=32558: Tue Jul  6 22:29:32 2021
  read: IOPS=98, BW=24.6KiB/s (25.2kB/s)(59.5KiB/2416msec)
    clat (nsec): min=427, max=144206k, avg=9990218.42, stdev=22028713.82
     lat (nsec): min=455, max=144206k, avg=9990378.76, stdev=22028716.56
    clat percentiles (nsec):
     |  1.00th=[      884],  5.00th=[     1144], 10.00th=[     1160],
     | 20.00th=[     1272], 30.00th=[     1384], 40.00th=[     1560],
     | 50.00th=[     1672], 60.00th=[  1089536], 70.00th=[  5734400],
     | 80.00th=[ 15794176], 90.00th=[ 34340864], 95.00th=[ 54263808],
     | 99.00th=[120061952], 99.50th=[131596288], 99.90th=[143654912],
     | 99.95th=[143654912], 99.99th=[143654912]
   bw (  KiB/s): min=   19, max=   31, per=4.90%, avg=25.50, stdev= 5.20, samples=4
   iops        : min=   78, max=  124, avg=103.50, stdev=20.09, samples=4
  lat (nsec)   : 500=0.42%, 1000=0.84%
  lat (usec)   : 2=57.56%, 4=0.84%
  lat (msec)   : 2=2.10%, 4=3.78%, 10=11.76%, 20=5.46%, 50=12.18%
  lat (msec)   : 100=3.78%, 250=1.26%
  cpu          : usr=0.04%, sys=1.57%, ctx=97, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=238,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-r-random-512: (groupid=0, jobs=1): err= 0: pid=32559: Tue Jul  6 22:29:32 2021
  read: IOPS=91, BW=45.7KiB/s (46.8kB/s)(111KiB/2419msec)
    clat (nsec): min=345, max=135203k, avg=10800002.37, stdev=21116716.57
     lat (nsec): min=373, max=135203k, avg=10800163.67, stdev=21116713.47
    clat percentiles (nsec):
     |  1.00th=[      580],  5.00th=[     1160], 10.00th=[     1192],
     | 20.00th=[     1336], 30.00th=[     1560], 40.00th=[     1752],
     | 50.00th=[     2096], 60.00th=[  2736128], 70.00th=[  7569408],
     | 80.00th=[ 19529728], 90.00th=[ 34340864], 95.00th=[ 51642368],
     | 99.00th=[103284736], 99.50th=[119013376], 99.90th=[135266304],
     | 99.95th=[135266304], 99.99th=[135266304]
   bw (  KiB/s): min=   26, max=   69, per=9.21%, avg=47.75, stdev=17.86, samples=4
   iops        : min=   52, max=  138, avg=95.50, stdev=35.72, samples=4
  lat (nsec)   : 500=0.90%, 750=0.45%, 1000=0.90%
  lat (usec)   : 2=43.89%, 4=10.86%
  lat (msec)   : 2=0.45%, 4=4.52%, 10=11.76%, 20=6.33%, 50=14.03%
  lat (msec)   : 100=4.52%, 250=1.36%
  cpu          : usr=0.04%, sys=1.28%, ctx=96, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=221,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-r-random-1024: (groupid=0, jobs=1): err= 0: pid=32560: Tue Jul  6 22:29:32 2021
  read: IOPS=76, BW=76.6KiB/s (78.5kB/s)(187KiB/2440msec)
    clat (nsec): min=486, max=165737k, avg=12835875.09, stdev=24972933.61
     lat (nsec): min=525, max=165737k, avg=12836036.54, stdev=24972931.45
    clat percentiles (nsec):
     |  1.00th=[      660],  5.00th=[     1240], 10.00th=[     1320],
     | 20.00th=[     1512], 30.00th=[     1624], 40.00th=[     1752],
     | 50.00th=[   199680], 60.00th=[  5734400], 70.00th=[ 11075584],
     | 80.00th=[ 22675456], 90.00th=[ 40108032], 95.00th=[ 57933824],
     | 99.00th=[154140672], 99.50th=[166723584], 99.90th=[166723584],
     | 99.95th=[166723584], 99.99th=[166723584]
   bw (  KiB/s): min=   52, max=  106, per=16.46%, avg=84.00, stdev=23.15, samples=4
   iops        : min=   52, max=  106, avg=84.00, stdev=23.15, samples=4
  lat (nsec)   : 500=0.53%, 750=0.53%, 1000=1.60%
  lat (usec)   : 2=42.78%, 4=3.21%, 250=1.60%
  lat (msec)   : 2=0.53%, 4=3.74%, 10=13.90%, 20=10.70%, 50=13.90%
  lat (msec)   : 100=5.35%, 250=1.60%
  cpu          : usr=0.00%, sys=1.64%, ctx=98, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=187,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-r-random-2048: (groupid=0, jobs=1): err= 0: pid=32561: Tue Jul  6 22:29:32 2021
  read: IOPS=77, BW=154KiB/s (158kB/s)(376KiB/2434msec)
    clat (nsec): min=660, max=148592k, avg=12785515.72, stdev=22703038.66
     lat (nsec): min=721, max=148592k, avg=12785693.50, stdev=22703041.73
    clat percentiles (nsec):
     |  1.00th=[     1240],  5.00th=[     1640], 10.00th=[     1720],
     | 20.00th=[     1864], 30.00th=[     2192], 40.00th=[   284672],
     | 50.00th=[  3719168], 60.00th=[  5734400], 70.00th=[ 11468800],
     | 80.00th=[ 19267584], 90.00th=[ 40632320], 95.00th=[ 66846720],
     | 99.00th=[117964800], 99.50th=[147849216], 99.90th=[147849216],
     | 99.95th=[147849216], 99.99th=[147849216]
   bw (  KiB/s): min=  116, max=  184, per=32.53%, avg=166.00, stdev=33.39, samples=4
   iops        : min=   58, max=   92, avg=83.00, stdev=16.69, samples=4
  lat (nsec)   : 750=0.53%
  lat (usec)   : 2=25.53%, 4=6.38%, 250=7.45%, 500=1.06%
  lat (msec)   : 2=2.13%, 4=6.91%, 10=17.02%, 20=13.30%, 50=13.30%
  lat (msec)   : 100=4.79%, 250=1.60%
  cpu          : usr=0.00%, sys=1.27%, ctx=130, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=188,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-r-random-4096: (groupid=0, jobs=1): err= 0: pid=32562: Tue Jul  6 22:29:32 2021
  read: IOPS=52, BW=211KiB/s (216kB/s)(512KiB/2428msec)
    clat (usec): min=195, max=154312, avg=18657.09, stdev=28661.47
     lat (usec): min=195, max=154312, avg=18657.33, stdev=28661.48
    clat percentiles (usec):
     |  1.00th=[   202],  5.00th=[   219], 10.00th=[   223], 20.00th=[   260],
     | 30.00th=[  1893], 40.00th=[  5407], 50.00th=[  5735], 60.00th=[ 10552],
     | 70.00th=[ 17171], 80.00th=[ 33162], 90.00th=[ 52691], 95.00th=[ 72877],
     | 99.00th=[137364], 99.50th=[154141], 99.90th=[154141], 99.95th=[154141],
     | 99.99th=[154141]
   bw (  KiB/s): min=  176, max=  360, per=45.86%, avg=234.50, stdev=85.38, samples=4
   iops        : min=   44, max=   90, avg=58.50, stdev=21.44, samples=4
  lat (usec)   : 250=16.41%, 500=11.72%
  lat (msec)   : 2=2.34%, 4=5.47%, 10=22.66%, 20=12.50%, 50=17.97%
  lat (msec)   : 100=7.81%, 250=3.12%
  cpu          : usr=0.00%, sys=1.65%, ctx=132, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=128,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-w-random-256: (groupid=0, jobs=1): err= 0: pid=32563: Tue Jul  6 22:29:32 2021
  write: IOPS=67, BW=17.0KiB/s (17.4kB/s)(41.5KiB/2446msec); 0 zone resets
    clat (nsec): min=1011, max=213044k, avg=14498133.05, stdev=32242802.04
     lat (nsec): min=1053, max=213045k, avg=14498331.22, stdev=32242810.34
    clat percentiles (nsec):
     |  1.00th=[     1928],  5.00th=[     2320], 10.00th=[     2448],
     | 20.00th=[     2608], 30.00th=[     3088], 40.00th=[     5472],
     | 50.00th=[     5920], 60.00th=[  3325952], 70.00th=[  7438336],
     | 80.00th=[ 19529728], 90.00th=[ 41680896], 95.00th=[ 74973184],
     | 99.00th=[179306496], 99.50th=[212860928], 99.90th=[212860928],
     | 99.95th=[212860928], 99.99th=[212860928]
   bw (  KiB/s): min=   12, max=   21, per=0.01%, avg=17.25, stdev= 3.77, samples=4
   iops        : min=   50, max=   84, avg=70.50, stdev=14.46, samples=4
  lat (usec)   : 2=1.20%, 4=31.33%, 10=22.29%, 50=0.60%
  lat (msec)   : 2=2.41%, 4=4.82%, 10=9.04%, 20=8.43%, 50=10.84%
  lat (msec)   : 100=4.82%, 250=4.22%
  cpu          : usr=0.00%, sys=1.64%, ctx=148, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,166,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-w-random-512: (groupid=0, jobs=1): err= 0: pid=32564: Tue Jul  6 22:29:32 2021
  write: IOPS=61, BW=30.8KiB/s (31.5kB/s)(75.5KiB/2452msec); 0 zone resets
    clat (usec): min=2, max=174884, avg=15952.60, stdev=28090.44
     lat (usec): min=2, max=174884, avg=15952.82, stdev=28090.45
    clat percentiles (usec):
     |  1.00th=[     3],  5.00th=[     3], 10.00th=[     3], 20.00th=[     3],
     | 30.00th=[     6], 40.00th=[     7], 50.00th=[  1500], 60.00th=[  5735],
     | 70.00th=[ 15795], 80.00th=[ 26346], 90.00th=[ 54264], 95.00th=[ 72877],
     | 99.00th=[125305], 99.50th=[175113], 99.90th=[175113], 99.95th=[175113],
     | 99.99th=[175113]
   bw (  KiB/s): min=   31, max=   38, per=0.02%, avg=33.25, stdev= 3.30, samples=4
   iops        : min=   62, max=   76, avg=66.50, stdev= 6.61, samples=4
  lat (usec)   : 4=24.50%, 10=23.84%
  lat (msec)   : 2=2.65%, 4=5.30%, 10=9.27%, 20=7.95%, 50=15.23%
  lat (msec)   : 100=7.95%, 250=3.31%
  cpu          : usr=0.00%, sys=1.80%, ctx=159, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,151,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-w-random-1024: (groupid=0, jobs=1): err= 0: pid=32565: Tue Jul  6 22:29:32 2021
  write: IOPS=75, BW=75.0KiB/s (76.8kB/s)(182KiB/2426msec); 0 zone resets
    clat (usec): min=2, max=194311, avg=13066.64, stdev=25405.18
     lat (usec): min=2, max=194311, avg=13066.87, stdev=25405.19
    clat percentiles (usec):
     |  1.00th=[     3],  5.00th=[     3], 10.00th=[     3], 20.00th=[     4],
     | 30.00th=[     6], 40.00th=[     7], 50.00th=[   188], 60.00th=[  5735],
     | 70.00th=[ 10028], 80.00th=[ 22938], 90.00th=[ 40109], 95.00th=[ 51119],
     | 99.00th=[131597], 99.50th=[193987], 99.90th=[193987], 99.95th=[193987],
     | 99.99th=[193987]
   bw (  KiB/s): min=   57, max=   88, per=0.05%, avg=77.75, stdev=14.06, samples=4
   iops        : min=   57, max=   88, avg=77.75, stdev=14.06, samples=4
  lat (usec)   : 4=20.33%, 10=28.02%, 20=0.55%, 250=1.10%
  lat (msec)   : 2=0.55%, 4=3.30%, 10=16.48%, 20=6.04%, 50=18.13%
  lat (msec)   : 100=3.30%, 250=2.20%
  cpu          : usr=0.00%, sys=2.02%, ctx=190, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,182,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-w-random-2048: (groupid=0, jobs=1): err= 0: pid=32566: Tue Jul  6 22:29:32 2021
  write: IOPS=75, BW=151KiB/s (155kB/s)(366KiB/2423msec); 0 zone resets
    clat (usec): min=2, max=143653, avg=12951.27, stdev=19734.05
     lat (usec): min=2, max=143653, avg=12951.54, stdev=19734.03
    clat percentiles (usec):
     |  1.00th=[     4],  5.00th=[     6], 10.00th=[     6], 20.00th=[     7],
     | 30.00th=[   198], 40.00th=[  3228], 50.00th=[  5735], 60.00th=[  8160],
     | 70.00th=[ 16188], 80.00th=[ 22676], 90.00th=[ 36439], 95.00th=[ 51643],
     | 99.00th=[ 96994], 99.50th=[143655], 99.90th=[143655], 99.95th=[143655],
     | 99.99th=[143655]
   bw (  KiB/s): min=  149, max=  184, per=0.10%, avg=160.25, stdev=16.09, samples=4
   iops        : min=   74, max=   92, avg=80.00, stdev= 8.16, samples=4
  lat (usec)   : 4=4.37%, 10=22.95%, 20=1.09%, 250=6.01%, 500=0.55%
  lat (msec)   : 2=1.09%, 4=6.56%, 10=19.67%, 20=15.30%, 50=16.94%
  lat (msec)   : 100=4.92%, 250=0.55%
  cpu          : usr=0.00%, sys=2.19%, ctx=263, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,183,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pmem-w-random-4096: (groupid=0, jobs=1): err= 0: pid=32567: Tue Jul  6 22:29:32 2021
  write: IOPS=329k, BW=1286MiB/s (1349MB/s)(400MiB/311msec); 0 zone resets
    clat (nsec): min=793, max=372277, avg=2175.72, stdev=1301.06
     lat (nsec): min=833, max=372317, avg=2215.51, stdev=1301.26
    clat percentiles (nsec):
     |  1.00th=[  972],  5.00th=[ 1336], 10.00th=[ 1528], 20.00th=[ 1608],
     | 30.00th=[ 1752], 40.00th=[ 2064], 50.00th=[ 2160], 60.00th=[ 2288],
     | 70.00th=[ 2416], 80.00th=[ 2608], 90.00th=[ 2960], 95.00th=[ 3216],
     | 99.00th=[ 3760], 99.50th=[ 4016], 99.90th=[ 4896], 99.95th=[ 5536],
     | 99.99th=[ 6880]
  lat (nsec)   : 1000=1.32%
  lat (usec)   : 2=33.94%, 4=64.20%, 10=0.54%, 20=0.01%, 50=0.01%
  lat (usec)   : 500=0.01%
  cpu          : usr=11.61%, sys=87.74%, ctx=3, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,102400,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=510KiB/s (522kB/s), 24.6KiB/s-211KiB/s (25.2kB/s-216kB/s), io=1245KiB (1275kB), run=2416-2440msec
  WRITE: bw=163MiB/s (171MB/s), 17.0KiB/s-1286MiB/s (17.4kB/s-1349MB/s), io=401MiB (420MB), run=311-2452msec

Disk stats (read/write):
  sda: ios=900/3, merge=0/9, ticks=20736/304, in_queue=20588, util=34.58%